<template>
  <div
    class="width-full d-flex flex-center mt-5 flex-column gap-6"
    style="padding: 10px"
  >
    <div class="max-width-1200 width-full">
      <h1 class="text-center font-md-res persian-font">
        سوالات متداول در مورد ساخت و دانلود رزومه
      </h1>
      <div
        class="d-flex flex-center flex-column gap-6 mt-5"
        :data-aos="$viewport.isGreaterThan('mobile') ? 'zoom-in' : ''"
        data-aos-duration="1000"
        data-aos-easing="ease"
        style="margin-bottom: 50px"
      >
        <cv-faq
          v-for="(item, index) in faqList"
          :item
          :index
          :data-aos="$viewport.isLessThan('tablet') ? 'zoom-in' : ''"
          data-aos-duration="1000"
          data-aos-easing="ease"
        />
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
const faqList = ref([
  {
    title: "چرا استفاده از رزومه‌ساز آنلاین توصیه می‌شود؟",
    description:
      "با استفاده از نرم‌افزار مدیریت رزومه، دغدغه شما نسبت به طراحی، چیدمان و انتخاب بخش‌های ضروری رزومه رفع می‌شود. در نتیجه شما فقط بر روی محتوای اطلاعاتی هر بخش متمرکز خواهید شد.",
  },
  {
    title: "ساخت رزومه با سی‌وی‌بیلدر چقدر زمان می برد؟",
    description:
      "به کمک سرویس هوش مصنوعی رزومه ساز، شما می توانید در چند ثانیه نسخه اولیه رزومه ی مربوط به شغل مورد نظر را داشته باشید. تنها کاری که بعد از آن باید انجام دهید، اصلاح برخی بخش‌ها و افزودن اطلاعات تکمیلی است.",
  },
  {
    title: "آیا تهیه و دانلود فایل رزومه در سی‌وی‌بیلدر رایگان است؟",
    description:
      "شما می توانید رزومه تان را بسازید و اطلاعات آن را ذخیره کنید. همه قالب‌های رزومه نسخه رایگان با واترمارک CvBuilder.me دارند. بنابراین می توانید از نسخه رایگان به شکل نامحدود استفاده کنید. هر زمان نیاز به نسخه بدون واترمارک داشتید با پرداخت هزینه بسیار ناچیز هر قالب، فایل PDF آن را به صورت دائمی بدون واترمارک دانلود کنید.",
  },
  {
    title: " آیا بعد از دریافت فایل رزومه، امکان ویرایش آن وجود دارد؟",
    description:
      "بله شما می توانید با یک اکانت از دستگاه‌های مختلف در حساب کاربری خود وارد شوید، رزومه‌های خود را ببینید، بروزرسانی کنید و فایل جدید آن را دانلود کنید. هیچ محدودیتی در تعداد دفعات ویرایش و دریافت فایل رزومه نیست.",
  },
  {
    title:
      "چطور می‌توانم نسخه آنلاین رزومه‌ام را در شبکه‌های اجتماعی به اشتراک بگذارم؟",
    description:
      "برای این منظور نسخه آنلاین رزومه در فرمت پورتفولیو شخصی شما به صورت رایگان در اختیار شماست. شما می توانید در پنل کاربری بخش تنظیمات پورتفولیو، از بین قالب‌های موجود یکی را انتخاب کرده، رزومه‌های فارسی و انگلیسی خود را در این بخش معرف کنید و بعد از ذخیره تنظیمات نسخه آنلاین رزومه را مشاهده و به اشتراک بگذارید.",
  },
]);
</script>

<style lang="scss" scoped></style>
