<template>
  <div class="width-full">
    <MainHeader />
    <CvFeatures />
    <CvSomeInfo />
    <SideInfo :info-item="sideInfo1" />
    <SideInfo :info-item="sideInfo2" />
    <SideInfo :info-item="sideInfo3" />
    <SideInfo :info-item="lastSideInfo" />
  </div>
</template>

<script setup lang="ts">
import type { item } from "~/components/types/sideInfo.t";
const sideInfo1: item = {
  title: "چرا بهتر است از رزومه ساز استفاده کنم؟",
  imageLink: "https://cvbuilder.me/images/features/why-resume-maker.png",
  description: `
    استفاده از رزومه ساز، فرآیند ایجاد رزومه را بسیار سریعتر و آسان‌تر می کند. آیا تا به حال سعی کرده‌اید رزومه‌تان را با نرم افزار WORD بسازید؟ گاهی اوقات اگر یک تغییر کوچک در رزومه ایجاد کنید، چینش رزومه شما تغییر می کند.
با رزومه‌ساز آنلاین، شما بدون نگرانی از مسائلی مانند چینش بخش‌ها یا تنظیم فاصله‌‌ی پاراگراف‌ها، فقط به محتوای رزومه فکر می‌کنید. کافی است یک قالب رزومه انتخاب کرده، فرم اطلاعات رزومه را پر کنید و فایل رزومه را دانلود کنید.
    `,
  hasAction: true,
};
const sideInfo2: item = {
  title: "بهترین رزومه ساز کدام است؟",
  imageLink: "https://cvbuilder.me/images/features/best-resume-maker.png",
  description:
    "با بیش از پنج سال تجربه در این زمینه، سی‌وی‌بیلدر نقش یک نرم‌افزار حرفه‌ای مدیریت رزومه را ایفا می‌کند. ما همواره سعی کرده‌ایم براساس پیشنهادهای کاربران ابزار ساخت رزومه را بهبود بخشیده و ویژگی‌های جدیدی به آن اضافه کنیم. ویژگی‌های متمایز کننده زیر، سی‌وی‌بیلدر را به انتخاب اول شما برای ایجاد رزومه شغلی یا تحصیلی تبدیل کرده است:",
  reverse: true,
  listItem: [
    "ساخت و ترجمه رزومه به کمک هوش مصنوعی",
    "سهولت استفاده",
    "تجربه کاربری مناسب",
    "خروجی PDF با کیفیت",
    "قابلیت مدیریت چندین رزومه",
    "نسخه رایگان PDF (با واترمارک) از همه قالب‌ها",
    "تکمیل سریع‌تر فرم رزومه با پیشنهاد عنوان برای مهارت‌ها، رشته‌های تحصیلی، اسامی دانشگاه‌ها، اسامی شرکت‌ها",
    "قابلیت افزودن بخش‌های تکمیلی مثل سوابق کارآموزی، فعالیت‌های داوطلبانه، عضویت‌ها و ... به همراه امکان تغییر عناوین هر بخش",
    "قابلیت تغییر ترتیب اطلاعات هر بخش و همینطور تغییر چینش بخش‌ها نسبت به هم برای ایجاد رزومه‌های دلخواه",
  ],
};
const sideInfo3: item = {
  title: "سی‌وی‌بیلدر، نرم‌افزاری حرفه‌ای برای رزومه‌سازی",
  imageLink: "https://cvbuilder.me/images/features/why-cvbuilder_me.png",
  description: `
  رزومه‌ساز سه زبانه CvBuilder، حرفه‌ای ترین رزومه ساز آنلاین ایرانی است. به کمک هوش مصنوعی می‌توانید رزومه شغلی یا تحصیلی را در کمتر از 10 دقیقه در زبان‌های فارسی، انگلیسی و آلمانی بسازید. پس از ساخت یا ویرایش رزومه می‌توانید فایل PDF رزومه را به شکل نامحدود دانلود کنید.
به جای نوشتن رزومه، تنها کافی است اطلاعات شغلی و مهارتی را در فرم رزومه‌ساز وارد کنید. سپس یک قالب رزومه انتخاب کنید و فایل PDF رزومه کاری یا تحصیلی را دریافت کنید. در صفحه قالب‌های رزومه می توانید قالب های رزومه را مشاهده کرده و یکی از آنها را برای ساخت رزومه انتخاب کنید. اگر هم برای ساختن رزومه به زبان انگلیسی یا فارسی نیاز به راهنمایی دارید، می توانید از نمونه رزومه های کاری تکمیل شده، کمک بگیرید.
  `,
};
const lastSideInfo: item = {
  title: "تفاوت بین CV و رزومه چیست؟",
  imageLink: "https://cvbuilder.me/images/features/cv-vs-resume.png",
  description:
    " در اتحادیه اروپا، کلمات CV و «رزومه» به جای یکدیگر استفاده می شوند. در ایالات متحده، رزومه مدرکی است که برای درخواست شغل از آن استفاده می‌کنید، ولی سی‌وی (CV) عمدتاً توسط دانشگاهیان استفاده می شود.رزومه (که گاهی با عنوان سی‌وی یا رزومه تحصیلی هم شناخته می شود) یک سند 1 یا 2 صفحه‌ای است که تجربه کاری و سابقه شغلی شما را خلاصه می‌کند. رزومه معمولاً شامل اطلاعاتی در مورد موارد زیر است:",
  hasActionOnBottom: true,
  reverse: true,
  listItem: [
    "اطلاعات تماس",
    "خلاصه رزومه",
    "سوابق کاری و دستاوردها",
    "مهارت‌ها و صلاحیت‌ها",
    "پیشینه تحصیلی",
  ],
};
</script>

<style lang="scss" scoped></style>
